Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Observability can be defined as the capability to allow a human to ask and answer questions about a system.
ja_jp: オブザーバビリティーは、人間がシステムについて質問したり答えたりできる能力として定義できます。

source: Observability in Quarkus
ja_jp: Quarkusにおけるオブザーバビリティ

source: Observable Gauges should be used to measure non-additive values. A value that can increase or decrease over time, like the speedometer on a car. Gauges can be useful when monitoring the statistics for a cache or collection.
ja_jp: 非加算値を測定するには、観測可能なゲージを使用する必要があります。 車のスピードメーターのように、時間の経過とともに増加または減少する値です。 ゲージは、キャッシュまたはコレクションの統計を監視するときに役立ちます。

source: Observe OIDC event.
ja_jp: OIDC イベントを確認します。

source: Observe a `ShutdownEvent` to be notified when the runtime is going to shut down.
ja_jp: ランタイムのシャットダウン時に `ShutdownEvent` で通知されるのを確認します。

source: Observe a `ShutdownEvent` to be notified when the runtime is going to shutdown.
ja_jp: ランタイムがシャットダウンするときに通知されるように、 `ShutdownEvent` を監視します。

source: Observe a `StartupEvent` to be notified the runtime has started.
ja_jp: `StartupEvent` でランタイムの開始が通知されるのを確認します。

source: Observe security events
ja_jp: セキュリティイベントの監視

source: Observe the `io.quarkus.vertx.http.security.HttpSecurity` CDI event and configure Form authentication mechanism programmatically.
ja_jp: `io.quarkus.vertx.http.security.HttpSecurity` CDI イベントを監視し、Form 認証メカニズムをプログラムで設定します。

source: Observe the console to verify that the following messages has been displayed: - `Cron expression hardcoded` - `Cron expression configured in application.properties` - `Fixed Rate expression` - `Fixed Rate expression configured in application.properties` These messages indicate that the executions of methods annotated with `@Scheduled` have been triggered.
ja_jp: コンソールを見て、以下のメッセージが表示されていることを確認してください: - `Cron expression hardcoded` - `Cron expression configured in application.properties` - `Fixed Rate expression` - `Fixed Rate expression configured in application.properties` これらのメッセージは、 `@Scheduled` でアノテーションされたメソッドの実行がトリガーされたことを示しています。

source: Observe the console to verify that the message `Cron expression configured in application.properties` has been displayed indicating that the cron job using an expression configured in `application.properties` has been triggered.
ja_jp: コンソールを見て、 `application.properties` で構成された式を使用する cron ジョブがトリガーされたことを示すメッセージ `Cron expression configured in application.properties` が表示されたことを確認します。

source: Observe what is printed in the second terminal. You should see something along the lines of:
ja_jp: 2 番目のターミナルに表示されているものを確認します。次の行に何かが表示されているはずです。

source: Observes `ServiceBinding` resources for workloads intended to be bound to a particular service
ja_jp: 特定のサービスにバインドされることを意図したワークロードの `ServiceBinding` リソースを観察する

source: Observing Container Startup
ja_jp: コンテナの起動を観察

source: Observing events
ja_jp: イベントの観察

source: Observing instrumentable objects
ja_jp: インストルメント可能なオブジェクトの観察

source: Obtain a login challenge
ja_jp: ログインチャレンジの取得

source: Obtain a reference to a MeterRegistry
ja_jp: MeterRegistry への参照を取得する

source: Obtain a reference to the Meter
ja_jp: Meter への参照の取得

source: Obtain a registration challenge
ja_jp: 登録チャレンジの取得

source: Obtain a resource representation, should not modify state, link:{httpspec}#section-4.2.2[idempotent] (link:{httpspec}#section-4.3.1[HTTP docs])
ja_jp: リソース表現を取得します。状態を変更しないでください。link:{httpspec}#section-4.2.2[idempotent] (link:{httpspec}#section-4.3.1[HTTP docs])

source: Obtain an access token for `alice`:
ja_jp: `alice` のアクセストークンを取得します:

source: Obtain information about a resource, link:{httpspec}#section-4.2.2[idempotent] (link:{httpspec}#section-4.3.7[HTTP docs])
ja_jp: リソースに関する情報を取得します。link:{httpspec}#section-4.2.2[idempotent] (link:{httpspec}#section-4.3.7[HTTP docs]) です。

source: Obtain metadata about a resource, similar to `GET` with no body (link:{httpspec}#section-4.3.2[HTTP docs])
ja_jp: 本文のない `GET` と同様に、リソースに関するメタデータを取得します (link:{httpspec}#section-4.3.2[HTTP docs])

source: Obtain the values to store in the event from an `IdProducer` and set them just before committing the event.
ja_jp: `IdProducer` からイベントに格納する値を取得し、イベントをコミットする直前にそれらを設定します。

source: Obtained via
ja_jp: 取得方法

source: Obtaining a Fragment
ja_jp: フラグメントの取得

source: Obtaining an access token
ja_jp: アクセストークンの取得

source: Obtaining the certificate
ja_jp: 証明書の取得

source: Obtaining the subject
ja_jp: subject の取得

source: Obtains the `InterceptionProxy` for `MyClass`, as declared above. It would also be possible to use the `getInjectedReference()` method, passing a `TypeLiteral`, but `getInterceptionProxy()` is easier.
ja_jp: 上記で宣言したように、 `MyClass` の `InterceptionProxy` を取得します。 `TypeLiteral` を渡して `getInjectedReference()` メソッドを使用することも可能ですが、 `getInterceptionProxy()` の方が簡単です。

source: Obtains the template fragment with identifier `item_aliases`.
ja_jp: 識別子 `item_aliases` を持つテンプレートフラグメントを取得します。

source: Obviously you can create your liveness and readiness probes based on the respective endpoints `/q/health/live` and `/q/health/ready`.
ja_jp: 言うまでもなく、それぞれのエンドポイント `/q/health/live` と `/q/health/ready` に対して自前の Liveness および Rediness プローブを作成することもできます。

source: Obviously, for each listed type, you can declare only one bean.
ja_jp: 勿論、リストされた各型に対して、宣言することができるのは1つのBeanだけです。

source: Obviously, if your application genuinely needs `UUID` generation, go ahead and use it.
ja_jp: 言うまでもなく、アプリケーションが本当に `UUID` 生成を必要とするのであれば、そのまま使用してください。

source: Obviously, this is a very simple example and you can do much more complex things with a Quarkus extension.
ja_jp: もちろん、これは非常に単純な例であり、Quarkusのエクステンションを使えば、もっと複雑なことができます。

source: Obviously, this is not for production: we drop and recreate the index every time we start the application.
ja_jp: 明らかに、これは本番用ではありません。アプリケーションを起動するたびに、インデックスを削除して再作成します。

source: Obviously, we could fork the GitHub API and avoid generating the bridge methods.
ja_jp: もちろん、GitHub API をフォークしてブリッジメソッドを生成しないようにすることもできます。

source: Obviously, you can pick any load-balancing strategy or even implement your own one!
ja_jp: もちろん、任意のロードバランシング戦略を選択することも、独自のロードバランシング戦略を実装することもできます。

source: Of course no remote repository was affected as we can appreciate the `-Djreleaser.dry.run=true` property was in effect. If you're so inclined inspect the contents of `target/jreleaser/package/app/brew/Formula/app.rb` which defines the Homebrew formula to be published. It should look something like this:
ja_jp: もちろん、 `-Djreleaser.dry.run=true` プロパティが有効だったので、リモートリポジトリは影響を受けませんでした。もし気になる場合は、公開するHomebrewの公式を定義している `target/jreleaser/package/app/brew/Formula/app.rb` の内容を確認してください。以下のようになるはずです：

source: Of course no remote repository was affected as we can appreciate the `-Djreleaser.dryrun` property was in effect. If you're so inclined inspect the contents of `target/jreleaser/package/app/brew/Formula/app.rb` which defines the Homebrew formula to be published. It should look something like this:
ja_jp: もちろん、 `-Djreleaser.dryrun` プロパティーが有効であることがわかるため、リモートリポジトリーは影響を受けませんでした。気になる場合は、公開する Homebrew 式を定義する `target/jreleaser/package/app/brew/Formula/app.rb` の内容を調べてください。次のようになります。

source: Of course, even with this configuration, Hibernate Search still won't be able to index anything or run search queries until the Elasticsearch cluster becomes accessible.
ja_jp: もちろん、この構成でも、Elasticsearchクラスタにアクセスできるようになるまでは、Hibernate Searchはインデックスを作成したり、検索クエリを実行したりすることはできません。

source: Of course, the example illustrated in this article plays in the context of integration, where you’re enabling access or integrating source systems, performing data processing of some sort, and connecting and sending data to back endpoints.
ja_jp: もちろん、この記事の例では、ソースシステムへのアクセスやインテグレーションを可能にし、何らかのデータ処理を行い、バックエンドポイントにデータを接続して送信するという、インテグレーションの文脈で説明されています。

source: Of course, this is only a requirement for this guide, not any application using the Reactive PostgreSQL Client.
ja_jp: もちろん、これはこのガイドの要件に過ぎず、Reactive PostgreSQLクライアントを使用したアプリケーションではありません。

source: Of course, we highly recommend you not to block.
ja_jp: もちろん、ブロックしないことを強くお勧めします。

source: Of course, you can also define a custom `UniAsserterInterceptor` to wrap the injected `UniAsserter` and customize the behavior.
ja_jp: もちろん、カスタムの `UniAsserterInterceptor` を定義して、注入された `UniAsserter` をラップし、動作をカスタマイズすることもできます。

source: Of course, you can use the Heroku CLI to connect this repo to your GitHub account, too, but this is out of scope for this guide.
ja_jp: もちろん、Heroku CLIを使ってこのレポジトリをGitHubアカウントに接続することもできますが、これはこのガイドでは対象外です。

source: Of course, you’ll most likely need to build on this, so you may want to write up your own playbook, rather than just using the one provided by the collection. Below is an example of such playbook:
ja_jp: もちろん、これに基づいて構築する必要がある可能性が高いため、コレクションによって提供されるプレイブックを単に使用するのではなく、独自のプレイブックを作成することもできます。 以下はそのようなプレイブックの例です。

source: Of each `Lesson`:
ja_jp: 各 `レッスン` の:

source: Offering
ja_jp: オファリング

source: Offerings and support scopes may be used by Quarkus dev tools, such as Quarkus CLI and code.quarkus, to display and/or filter extensions by the relevant support-related information.
ja_jp: 提供物とサポートスコープは、Quarkus CLI や code.quarkus などの Quarkus 開発ツールによって、関連するサポート情報に基づいてエクステンションを表示またはフィルターするために使用されることがあります。

source: Offline startup
ja_jp: オフライン起動

source: Offset commiting strategies in the Kafka connector
ja_jp: Kafkaコネクターにおけるオフセットコミット戦略

source: Often one obtains a JWT from an identity manager like https://www.keycloak.org/[Keycloak], but for this quickstart we will generate our own using the JWT generation API provided by `smallrye-jwt` (see xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT] for more information).
ja_jp: 多くの場合、 https://www.keycloak.org/[Keycloak] などの ID マネージャーから JWT を取得しますが、このクイックスタートでは、 `smallrye-jwt` が提供する JWT 生成 API を使用して独自の JWT を生成します (詳細は xref:security-jwt-build.adoc[SmallRye JWT を使用した JWT トークンの生成] を参照してください)。

source: Often one obtains a JWT from an identity manager like https://www.keycloak.org/[Keycloak], but for this quickstart we will generate our own using the JWT generation API provided by `smallrye-jwt` (see xref:smallrye-jwt-build.adoc[Generate JWT tokens with SmallRye JWT] for more information).
ja_jp: 多くの場合、 https://www.keycloak.org/[Keycloak] などの ID マネージャーから JWT を取得しますが、このクイックスタートでは、 `smallrye-jwt` が提供する JWT 生成 API を使用して独自の JWT を生成します (詳細は xref:smallrye-jwt-build.adoc[SmallRye JWT を使用した JWT トークンの生成] を参照してください)。

source: Often one obtains a JWT from an identity manager like https://www.keycloak.org/[Keycloak], but for this quickstart we will generate our own using the JWT generation API provided by `smallrye-jwt`. For more information, see xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT].
ja_jp: 多くの場合、 link:https://www.keycloak.org/[Keycloak] のようなIDマネージャからJWTを取得しますが、このクイックスタートでは、 `smallrye-jwt` が提供するJWT生成APIを使用して独自に生成することにします。詳細は、xref:security-jwt-build.adoc[SmallRye JWTでJWTトークンを生成] を参照してください。

source: Often profiling, instrumenting or tracing applications is the best way to figure out how things work. In the case of RSS and native applications, the techniques that Brendan Gregg explains in the https://www.brendangregg.com/FlameGraphs/memoryflamegraphs.html["Memory Leak (and Growth) Flame Graphs"] guide are particularly useful. This section will apply the information in that article to show how to use `perf` and https://github.com/iovisor/bcc[bcc/eBPF] to understand what causes Quarkus native executables to consume memory on startup.
ja_jp: アプリケーションのプロファイリング、インストルメンテーション、トレースは、しばしば、物事がどのように動作するかを把握するための最良の方法となります。RSSやネイティブアプリケーションの場合、Brendan Greggが link:https://www.brendangregg.com/FlameGraphs/memoryflamegraphs.html[メモリリーク（と成長）フレームグラフ] ガイドで説明しているテクニックが特に有効です。このセクションでは、その記事の情報を応用して、 `perf` 、 link:https://github.com/iovisor/bcc[bcc/eBPF] を使用して、Quarkusのネイティブ実行可能ファイルが起動時にメモリを消費する原因を理解する方法を紹介します。

source: Often, one obtains a JWT from an identity manager such as link:https://www.keycloak.org/[Keycloak]. But for this quickstart, you generate our own by using the JWT generation API provided by `smallrye-jwt`. For more information, see xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT].
ja_jp: 多くの場合、JWT は link:https://www.keycloak.org/[Keycloak] などのアイデンティティーマネージャーから取得されます。 ただし、このクイックスタートでは、 `smallrye-jwt` によって提供される JWT 生成 API を使用して独自の JWT を生成します。 詳細は、xref:security-jwt-build.adoc[SmallRye JWT を使用して JWT トークンを生成する] を参照してください。

source: Oh well, that's just us loading a class for the first time... bummer.
ja_jp: 「ああ、これはただ初めてクラスをロードしているだけか... がっかりだ」

source: Oh yeah! We had quite a few extensions written outside the Quarkus "initial" team.
ja_jp: 勿論です! Quarkusの「初期」チームの外部でかなりの数のエクステンションが作成されました。

source: Oidc Provider Client Authentication
ja_jp: Oidc プロバイダークライアント認証

source: OidcClient Authentication
ja_jp: OidcClient 認証

source: OidcClient authentication
ja_jp: OidcClient 認証

source: Ok, maybe a bit of an exaggeration, but one of the things we've introduced in this new release is a small framework that makes it easier to quickly write good diagnostics for the various annotations. As a really simple example, here's the code required to support validation for the `delay` member value of the `@Scheduled` annotation.
ja_jp: ちょっと大げさかもしれませんが、この新しいリリースで導入されたもののひとつに、さまざまなアノテーションのための優れた診断をすばやく書くことを容易にする小さなフレームワークがあります。本当に簡単な例として、 `@Scheduled` アノテーションの `delay` メンバ値の検証をサポートするために必要なコードを紹介します。

source: Ok, so we definitely needed a new benchmark
ja_jp: よし、だから私たちは間違いなく新しいベンチマークが必要でした

source: Ok, so, how does it look? The easiest way to understand Cloud Event is to look at one of them:
ja_jp: さてさて、どんな感じでしょうか?クラウドイベントを理解する一番簡単な方法は、そのうちの一つを見てみることです:

source: Ok, we have seen how to receive messages, let's now switch to the _other side_: the sender. Sending and publishing messages use the Vert.x event bus:
ja_jp: さて、メッセージを受信する方法を見てきましたが、次は送信者 _側_ に切り替えましょう。メッセージの送信とパブリッシュは Vert.x イベントバスを使います。

source: Ok... it's been a while since our last newsletter but we've been busy working on a new format. We're moved to an email subscription model starting with Issue #10. Our goal is to allow folks to sign up and get the cream of the crop articles delivered to their inbox once a month.
ja_jp: 前回のニュースレターからしばらく経ってしまいましたが、私たちは新しいフォーマットを作るために忙しくしていました。10号からはメール購読モデルに移行しました。私たちの目標は、登録していただければ、月に一度、最高の記事をメールでお届けできるようにすることです。

source: Old
ja_jp: 旧

source: Old Sampler config value
ja_jp: 旧サンプラーの設定値

source: Old syntax versus new syntax
ja_jp: 古い構文と新しい構文

source: Old vs. new syntax
ja_jp: 古い構文と新しい構文

source: Ollama (local models like `llama3`)
ja_jp: Ollama (`llama3` などのローカルモデル)

source: On Fedora:
ja_jp: Fedora の場合:

source: On JDK 24+, this generates an `app.aot` file in `target/quarkus-app/` for Maven and `build/quarkus-app/` for Gradle.
ja_jp: JDK 24 以降では、これにより Maven の場合は `target/quarkus-app/` に、Gradle の場合は `build/quarkus-app/` に `app.aot` ファイルが生成されます。

source: On Linux it's possible to package a native executable that doesn't depend on any system shared library. There are https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/StaticImages/#preparation[some system requirements] to be fulfilled and additional build arguments to be used along with the `native-image` invocation, a minimum is `-Dquarkus.native.additional-build-args="--static","--libc=musl"`.
ja_jp: Linuxでは、システムの共有ライブラリに依存しないネイティブな実行ファイルをパッケージ化することが可能です。 link:https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/StaticImages/#preparation[システム要件] を満たす必要があり、 `native-image` の呼び出しとともに使用する追加のビルド引数があります。最低限必要なのは `-Dquarkus.native.additional-build-args="--static","--libc=musl"` です。

source: On Linux it's possible to package a native executable that doesn't depend on any system shared library. There are https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/guides/build-static-executables/#prerequisites-and-preparation[some system requirements] to be fulfilled and additional build arguments to be used along with the `native-image` invocation, a minimum is `-Dquarkus.native.additional-build-args="--static","--libc=musl"`.
ja_jp: Linux では、システムの共有ライブラリに依存しないネイティブな実行可能ファイルをパッケー ジ化できます。満たすべき link:https://www.graalvm.org/22.1/reference-manual/native-image/StaticImages/#preparation[いくつかのシステム要件] と、 `native-image` の呼び出しとともに使用する追加のビルド引数がありますが、最低限必要なのは `-Dquarkus.native.additional-build-args="--static","--libc=musl"` です。

source: On Linux it's possible to package a native executable that doesn't depend on any system shared library. There are link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/guides/build-static-executables/#prerequisites-and-preparation[some system requirements] to be fulfilled and additional build arguments to be used along with the `native-image` invocation, a minimum is `-Dquarkus.native.additional-build-args="--static","--libc=musl"`.
ja_jp: Linux では、システムの共有ライブラリに依存しないネイティブ実行可能ファイルをパッケー ジ化できます。 満たすべき link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/guides/build-static-executables/#prerequisites-and-preparation[いくつかのシステム要件] と、 `native-image` の呼び出しとともに使用する追加のビルド引数がありますが、最低限必要なのは `-Dquarkus.native.additional-build-args="--static","--libc=musl"` です。

source: On Linux systems, it's recommended to configure client access in a rootless configuration using a user systemd service.
ja_jp: Linux システムでは、ユーザー systemd サービスを使ってルートレス構成でクライアントアクセスを設定することをお勧めします。

source: On Linux you can enable the following socket options:
ja_jp: Linuxでは、以下のソケットオプションを有効にすることができます。

source: On Linux, Podman is integrated as part of the operating system, and installed through the system's packager manager. As with Mac, and Windows, Podman Desktop can also be installed to supplement the Podman CLI. However, on Linux, Podman Desktop acts as a client to the native Podman integration, and does not manage the underlying Podman installation.
ja_jp: Linuxでは、Podmanはオペレーティングシステムの一部として統合され、システムのパッケージャマネージャを通じてインストールされます。MacやWindowsと同様に、Podman CLIを補完するためにPodman Desktopをインストールすることもできます。ただしLinuxでは、Podman DesktopはネイティブPodman統合のクライアントとして動作し、基盤となるPodmanのインストールは管理しません。

source: On Linux, macOS, and Windows (using WSL or bash compatible shell like Cygwin or MinGW)
ja_jp: Linux、macOS、および Windows (WSL または Cygwin や MinGW などの bash 互換シェルを使用) の場合

source: On Linux, you will need GCC, and the glibc and zlib headers. Examples for common distributions:
ja_jp: Linuxでは、GCC、glibc、zlibヘッダが必要です。一般的なディストリビューションでは次の通りです:

source: On Linux/macOS you can run `<idecommand> `jbang edit quarkusapp.java``.
ja_jp: Linux/macOSでは、 `<idecommand> `jbang edit quarkusapp.java`` で実行できます。

source: On Mac:
ja_jp: Mac の場合:

source: On MacOS Sierra and above you can enable the following socket options:
ja_jp: MacOS Sierra以上では、以下のソケットオプションを有効にすることができます。

source: On Minikube or Kubernetes only the Super Heroes UI and the Fights service is exposed outside the cluster. If you want to access Prometheus or the Event Statistics service then you will need to expose it, either by using an `+Ingress+` or doing a `+kubectl port-forward+` of the Pod. On OpenShift, all of the applications have ``Route``s which expose them outside the cluster.
ja_jp: MinikubeやKubernetesでは、Super Heroes UIとFightsサービスだけがクラスタの外に公開されています。PrometheusやEvent Statisticsサービスにアクセスしたい場合は、 `Ingress` を使用するか、Podの `kubectl port-forward` を行って公開する必要があります。OpenShiftでは、すべてのアプリケーションに `Route`が用意されており、クラスター外に公開されています。

source: On Quarkiverse
ja_jp: Quarkiverse について

source: On Ubuntu:
ja_jp: Ubuntu の場合:

source: On Windows using Powershell:
ja_jp: Powershell を使用する Windows の場合:

source: On Windows, run as administrator from an elevated terminal to install the CA in the system truststore.
ja_jp: Windows では、管理者権限を持つターミナルから管理者として実行し、システムのトラストストアに CA をインストールしてください。

source: On Windows, you will have to go through the Control Panel to set your environment variables.
ja_jp: Windowsでは、コントロールパネルから環境変数を設定する必要があります。

source: On Windows, you will need to install the https://aka.ms/vs/15/release/vs_buildtools.exe[Visual Studio 2017 Visual C++ Build Tools]
ja_jp: Windowsの場合は、 https://aka.ms/vs/15/release/vs_buildtools.exe[Visual Studio 2017 Visual C++ Build Tools] をインストールする必要があります。

source: On Windows, you will need to install the https://aka.ms/vs/17/release/vs_buildtools.exe[Visual Studio 2022 Visual C++ Build Tools]
ja_jp: Windows では、 https://aka.ms/vs/17/release/vs_buildtools.exe[Visual Studio 2022 Visual C++ Build Tools] をインストールする必要があります。

source: On _outgoing_ channels, you can enable Snappy compression by setting the `compression.type` attribute to `snappy`:
ja_jp: _outgoing_ チャンネルでは、 `compression.type` 属性を `snappy` に設定することで、Snappy 圧縮を有効にすることができます。

source: On a post request, generate a random UUID and send it to the AMQP queue using the emitter.
ja_jp: ポストリクエストで、ランダムな UUID を生成し、エミッターを使用してこれを AMQP キューに送信します。

source: On a post request, generate a random UUID and send it to the Kafka topic using the emitter.
ja_jp: ポストリクエストで、ランダムな UUID を生成し、エミッターを使用してそれを Kafka トピックに送信します。

source: On a post request, generate a random UUID and send it to the Pulsar topic using the emitter.
ja_jp: ポストリクエストで、ランダムな UUID を生成し、エミッターを使用してそれを Pulsar トピックに送信します。

source: On a post request, generate a random UUID and send it to the RabbitMQ queue using the emitter.
ja_jp: 投稿リクエストで、ランダムなUUIDを生成し、エミッターを使ってRabbitMQのキューに送信します。

source: On dev-mode startup, the application will show you a list of your endpoints, along with a performance score telling you why your endpoint is slower than an optimal version. This helps a lot in figuring out how to improve REST performance.
ja_jp: 開発モードで起動すると、アプリケーションはエンドポイントのリストを表示し、エンドポイントが最適なバージョンよりも遅い理由を示すパフォーマンススコアを表示します。これは、REST のパフォーマンスを向上させる方法を見つけるのに非常に役立ちます。

source: On macOS (amd64/x86 based Macs not supported), point the variable to the `Home` sub-directory:
ja_jp: macOS (amd64/x86 ベースの Mac はサポートされていません) では、変数を `Home` サブディレクトリーに指定します。

source: On macOS (not supported by Mandrel), point the variable to the `Home` sub-directory:
ja_jp: macOS (Mandrel ではサポート対象外) では、変数を `Home` のサブディレクトリに指定します:

source: On macOS Sierra and above you can enable the following socket options:
ja_jp: MacOS Sierra以上では、以下のソケットオプションを有効にすることができます。

source: On macOS, you can use `ps x -o pid,rss,command -p <PID>` which list the RSS for a given process in KB (1024 bytes).
ja_jp: macOSでは、 `ps x -o pid,rss,command -p <PID>` と指定すると、指定したプロセスのRSSをKB（1024バイト）単位で一覧表示することができます。

source: On occasion, the stream of SSE events may contain some events that should not be returned by the client - an example of this is having the server send heartbeat events in order to keep the underlying TCP connection open. The REST Client supports filtering out such events by providing the `@org.jboss.resteasy.reactive.client.SseEventFilter`.
ja_jp: 場合によっては、SSE イベントのストリームに、クライアントから返されるべきではないイベントが含まれることがあります。この例としては、基盤となる TCP 接続を開いたままにするために、サーバーがハートビートイベントを送信することが挙げられます。 REST Client は、 `@org.jboss.resteasy.reactive.client.SseEventFilter` を提供することで、このようなイベントをフィルタリングすることをサポートします。

source: On startup the `setupHotDeployment` method will be called, and you can use the provided `io.quarkus.dev.spi.HotReplacementContext` to initiate a scan for changed files.
ja_jp: 起動時には `setupHotDeployment` メソッドが呼び出され、提供された `io.quarkus.dev.spi.HotReplacementContext` を使って変更されたファイルのスキャンを開始することができます。

source: On startup, you can configure the Redis client to preload data into the Redis database.
ja_jp: 起動時に、RedisクライアントはRedisデータベースにデータをプリロードするように設定することができます。
